In [2]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\acer\desktop\complete_dat_science\venv\lib\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.22.4 in c:\users\acer\desktop\complete_dat_science\venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\acer\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\desktop\complete_dat_science\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\acer\desktop\complete_dat_science\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\acer\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import  pandas as pd

In [4]:
## Series
import pandas as pd

data =  [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
## Create a series from dictionanry

data= {'a':1,'b':2,'c':3}

series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [7]:
## Datafram
## Create a dataframe from a dictionary of list

data ={
    'Name':['xitij','john','jack'],
    'Age':[21,30,24],
    'City':['Banglore','New York', 'florida']
}

df = pd.DataFrame(data)
print(df)

    Name  Age      City
0  xitij   21  Banglore
1   john   30  New York
2   jack   24   florida

In [8]:
import numpy as np

np.array(df)

array([['xitij', 21, 'Banglore'],
       ['john', 30, 'New York'],
       ['jack', 24, 'florida']], dtype=object)

In [ ]:
## Creat a data fram from a list of dictionaries

data = [
    {'Name':'Xitij','Age':21,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Jack','Age':20,'City':'Bangalore'},
    {'Name':'Suresh','Age':43,'City':'Bangalore'},
    {'Name':'Tejas','Age':29,'City':'Bangalore'},
]
df = pd.DataFrame(data)
print(df)

     Name  Age       City
0   Xitij   21  Bangalore
1    John   34  Bangalore
2    Jack   20  Bangalore
3  Suresh   43  Bangalore
4   Tejas   29  Bangalore

In [10]:
df

     Name  Age       City
0   Xitij   21  Bangalore
1    John   34  Bangalore
2    Jack   20  Bangalore
3  Suresh   43  Bangalore
4   Tejas   29  Bangalore

In [11]:
df['Name']

0     Xitij
1      John
2      Jack
3    Suresh
4     Tejas
Name: Name, dtype: object

In [12]:
## Accesing row index
df.loc[0]

Name        Xitij
Age            21
City    Bangalore
Name: 0, dtype: object

In [13]:
## Accecing column index
df.iloc[0]

Name        Xitij
Age            21
City    Bangalore
Name: 0, dtype: object

In [14]:
df.iloc[0][1]

C:\Users\ACER\AppData\Local\Temp\ipykernel_16252\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

np.int64(21)

In [15]:
## Accesing specified elemets
df.at[2,'Age']

np.int64(20)

In [16]:
## Accecing a specified elements using iat

df.iat[2,2]

'Bangalore'

In [19]:
## Accesing column elemets

df["Salary"] = [50000,20000,60000,70000,430000]
df

     Name  Age       City  Salary
0   Xitij   21  Bangalore   50000
1    John   34  Bangalore   20000
2    Jack   20  Bangalore   60000
3  Suresh   43  Bangalore   70000
4   Tejas   29  Bangalore  430000

In [23]:
## Remove a column
df.drop('Salary', axis=1, inplace=True)

In [22]:
df

     Name  Age       City  Salary
0   Xitij   21  Bangalore   50000
1    John   34  Bangalore   20000
2    Jack   20  Bangalore   60000
3  Suresh   43  Bangalore   70000
4   Tejas   29  Bangalore  430000

In [24]:
df

     Name  Age       City
0   Xitij   21  Bangalore
1    John   34  Bangalore
2    Jack   20  Bangalore
3  Suresh   43  Bangalore
4   Tejas   29  Bangalore

In [25]:
df.describe()

             Age
count   5.000000
mean   29.400000
std     9.555103
min    20.000000
25%    21.000000
50%    29.000000
75%    34.000000
max    43.000000